app/controllers/chords_controller.rb

  def index
    @chords = Chord.all
---
SELECT `chords`.* FROM `chords`

  def create
    @chord = Chord.new(chord_params)

    if @chord.save
---
INSERT INTO `chords` (`name`, `created_at`, `updated_at`, `lock_version`) VALUES ('C', '2016-07-11 07:44:14', '2016-07-11 07:44:14', 0)

    def set_chord
      @chord = Chord.find(params[:id])
---
SELECT  `chords`.* FROM `chords` WHERE `chords`.`id` = 3 LIMIT 1