app/controllers/codes_controller.rb

SELECT `codes`.* FROM `codes`
---
  def index
    @codes = Code.all

INSERT INTO `codes` (`name`, `created_at`, `updated_at`, `lock_version`) VALUES ('っｓｆｇｓｄｆｓｇ', '2016-07-11 05:33:37', '2016-07-11 05:33:37', 0)
---
  def create
    @code = Code.new(code_params)

    if @code.save

SELECT  `codes`.* FROM `codes` WHERE `codes`.`id` = 1 LIMIT 1
---
    def set_code
      @code = Code.find(params[:id])