app/controllers/composers_controller.rb

  def index
    @composers = Composer.all
---
SELECT `composers`.* FROM `composers`

  def create
    @composer = Composer.new(composer_params)

    respond_to do |format|
      if @composer.save
---
INSERT INTO `composers` (`name`, `created_at`, `updated_at`, `lock_version`) VALUES ('aiko', '2016-06-30 05:02:51', '2016-06-30 05:02:51', 0)

    def set_composer
      @composer = Composer.find(params[:id])
---
SELECT  `composers`.* FROM `composers` WHERE `composers`.`id` = 1 LIMIT 1