app/controllers/songs_controller.rb

  def index
    @songs = Song.all
---
SELECT `songs`.* FROM `songs`

  def create
    @song = Song.new(song_params)

    if @song.save
---
INSERT INTO `songs` (`title`, `composer_id`, `tempo`, `key`, `scale`, `created_at`, `updated_at`, `lock_version`) VALUES ('天体観測', 2, 190, 1, 0, '2016-07-02 14:03:30', '2016-07-02 14:03:30', 0)

  def update
    if @song.update(song_params)
---
UPDATE `songs` SET `songs`.`key` = 0, `songs`.`scale` = 1, `songs`.`updated_at` = '2016-07-03 07:07:28', `songs`.`lock_version` = 1 WHERE `songs`.`id` = 1 AND `songs`.`lock_version` = 0

    def set_song
      @song = Song.find(params[:id])
---
SELECT  `songs`.* FROM `songs` WHERE `songs`.`id` = 1 LIMIT 1